# ReferenceViewerAttrTag Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ReferenceViewerAttrTag Property
ParameterTypeId Class See Also
---
"View Reference Tag"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ReferenceViewerAttrTag { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ReferenceViewerAttrTag As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ReferenceViewerAttrTag {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace